yii/frontend/controllers/UserController.php

	public function actionIndex()
	{
		$request=Yii::$app->request;
		if($request->isPost)
		{
			$uname = $request->post('uname');
			$data=array('uname'=>$uname);
			$res=Yii::$app->db->createCommand()->insert('user666',$data)->execute();
---
INSERT INTO `user666` (`uname`) VALUES ('溜溜')

 	public function actionShow()
 	{
 		$query= new Query();
 		$data = $query->from("user666")->all();
---
SELECT * FROM `user666`

 	public function actionDel()
 	{
 		$request = Yii::$app->request;
 		$id = $request ->get("id");
 		$res=Yii::$app->db->createCommand()->delete('user666',"id='$id'")->execute();
---
DELETE FROM `user666` WHERE id='12'

 	public function actionUp()
 	{
 		$request = Yii::$app->request;
 		$id = $request->get("id");
 		$query = new Query();
 		$dataList=$query->from('user666')->where("id='$id'")->one();
 		//如果是POST传值则进行数据修改，如果不是，就调用该数据的展示页面
 		if($request->isPost)
 		{
 			$data = $request ->post();
 			unset($data['_csrf-frontend']);
 			$res=Yii::$app->db->createCommand()->update('user666',$data,"id='$id'")->execute();
---
SELECT * FROM `user666` WHERE id='12'
UPDATE `user666` SET `uname`='啊沙发舒服撒' WHERE id='6'